urzino/FanMonitoringBlueCoin/STM32CubeFunctionPack_ALLMEMS1_V3.2.0/Projects/Multi/Applications/ALLMEMS1/Src/main.c
#endif /* USE_STM32F4XX_NUCLEO */
    
#ifdef ALLMEMS1_ENABLE_SD_MEMS_RECORDING
  if(SD_LogAudio_Enabled)
  {
    AudioProcess_SD_Recording();
  } else
#endif /* ALLMEMS1_ENABLE_SD_MEMS_RECORDING */
  {
    if(W2ST_CHECK_CONNECTION(W2ST_CONNECT_AUDIO_LEVEL))
    {
      AudioProcess_DB_Noise();
    }
    
  #ifdef ALLMEMS1_ACOUSTIC_SOURCE_LOCALIZATION
    if(W2ST_CHECK_CONNECTION(W2ST_CONNECT_SL))
      AudioProcess_SL();
  #endif /* ALLMEMS1_ACOUSTIC_SOURCE_LOCALIZATION */
    
    /* Code for BlueVoice integration - Start Section */
    if(((W2ST_CHECK_CONNECTION(W2ST_CONNECT_BV_AUDIO))!=0) & ((W2ST_CHECK_CONNECTION(W2ST_CONNECT_BV_SYNC))!=0))
    {
      AudioProcess_BV();
    }
    /* Code for BlueVoice integration - End Section */
  }
}

/**
* @brief  User function that is called when 1 ms of PDM data is available.
* @param  none
* @retval None
*/
void AudioProcess_DB_Noise(void)
{
  int32_t i;
  int32_t NumberMic;
  
  if(W2ST_CHECK_CONNECTION(W2ST_CONNECT_AUDIO_LEVEL)) {
    for(i = 0; i < 16; i++){
      for(NumberMic=0;NumberMic<AUDIO_CHANNELS;NumberMic++) {
        RMS_Ch[NumberMic] += (float)((int16_t)PCM_Buffer[i*AUDIO_CHANNELS+NumberMic] * ((int16_t)PCM_Buffer[i*AUDIO_CHANNELS+NumberMic]));
      }
    }
  }
}

/**
  * @brief  Send Audio Level Data (Ch1) to BLE
  * @param  None
  * @retval None
  */
static void SendAudioLevelData(void)
{
  int32_t NumberMic;
  uint16_t DBNOISE_Value_Ch[AUDIO_CHANNELS];
  
  for(NumberMic=0;NumberMic<(AUDIO_CHANNELS);NumberMic++) {
    DBNOISE_Value_Ch[NumberMic] = 0;

    RMS_Ch[NumberMic] /= (16.0f*MICS_DB_UPDATE_MUL_10MS*10);

    DBNOISE_Value_Ch[NumberMic] = (uint16_t)((120.0f - 20 * log10f(32768 * (1 + 0.25f * (AUDIO_VOLUME_VALUE /*AudioInVolume*/ - 4))) + 10.0f * log10f(RMS_Ch[NumberMic])) * 0.3f + DBNOISE_Value_Old_Ch[NumberMic] * 0.7f);
    DBNOISE_Value_Old_Ch[NumberMic] = DBNOISE_Value_Ch[NumberMic];
    RMS_Ch[NumberMic] = 0.0f;
  }
  
  AudioLevel_Update(DBNOISE_Value_Ch);
}

#ifdef ALLMEMS1_ACOUSTIC_SOURCE_LOCALIZATION

/**
  * @brief  Send Audio Source Localization Data to BLE
  * @param  None
  * @retval None
  */
void SendAudioSourceLocalizationData(void)
{
  AudioSourceLocalization_Update(SourceLocationToSend);
 
#ifdef STM32_BLUECOIN
  if(SourceLocationToSend < 23)
    {
      BSP_LED_On(LED1);
      BSP_LED_Off(LED2);
      BSP_LED_Off(LED3);
      BSP_LED_Off(LED4);
      BSP_LED_Off(LED5);
      BSP_LED_Off(LED6);
      BSP_LED_Off(LED7);
      BSP_LED_Off(LED8);
    }
    else if(SourceLocationToSend < 23 + 45)
    {
      BSP_LED_Off(LED1);
      BSP_LED_On(LED2);
      BSP_LED_Off(LED3);
      BSP_LED_Off(LED4);
      BSP_LED_Off(LED5);
      BSP_LED_Off(LED6);
      BSP_LED_Off(LED7);
      BSP_LED_Off(LED8);
    }
    else if(SourceLocationToSend < 23 + 45*2)
    {
      BSP_LED_Off(LED1);
      BSP_LED_Off(LED2);
      BSP_LED_On(LED3);
      BSP_LED_Off(LED4);
      BSP_LED_Off(LED5);
      BSP_LED_Off(LED6);
      BSP_LED_Off(LED7);
      BSP_LED_Off(LED8);  
    }
    else if(SourceLocationToSend < 23 + 45*3)
    {
      BSP_LED_Off(LED1);
      BSP_LED_Off(LED2);
      BSP_LED_Off(LED3);
      BSP_LED_On(LED4);
      BSP_LED_Off(LED5);
      BSP_LED_Off(LED6);
      BSP_LED_Off(LED7);
      BSP_LED_Off(LED8);
    }
    else if(SourceLocationToSend < 23 + 45*4)
    {
      BSP_LED_Off(LED1);
      BSP_LED_Off(LED2);
      BSP_LED_Off(LED3);
      BSP_LED_Off(LED4);
      BSP_LED_On(LED5);
      BSP_LED_Off(LED6);
      BSP_LED_Off(LED7);
      BSP_LED_Off(LED8);
    }
    else if(SourceLocationToSend < 23 + 45*5)
    {
      BSP_LED_Off(LED1);
      BSP_LED_Off(LED2);
      BSP_LED_Off(LED3);
      BSP_LED_Off(LED4);
      BSP_LED_Off(LED5);
      BSP_LED_On(LED6);
      BSP_LED_Off(LED7);
      BSP_LED_Off(LED8);
    }
    else if(SourceLocationToSend < 23 + 45*6)
    {
      BSP_LED_Off(LED1);
      BSP_LED_Off(LED2);
      BSP_LED_Off(LED3);
      BSP_LED_Off(LED4);
      BSP_LED_Off(LED5);
      BSP_LED_Off(LED6);
      BSP_LED_On(LED7);
      BSP_LED_Off(LED8);    
    }
    else if(SourceLocationToSend < 23 + 45*7)
    {
      BSP_LED_Off(LED1);
      BSP_LED_Off(LED2);
      BSP_LED_Off(LED3);
      BSP_LED_Off(LED4);
      BSP_LED_Off(LED5);
      BSP_LED_Off(LED6);
      BSP_LED_Off(LED7);
      BSP_LED_On(LED8);
    }
    else if(SourceLocationToSend < 360)
    {
      BSP_LED_On(LED1);
      BSP_LED_Off(LED2);
      BSP_LED_Off(LED3);
      BSP_LED_Off(LED4);
      BSP_LED_Off(LED5);
      BSP_LED_Off(LED6);
      BSP_LED_Off(LED7);
      BSP_LED_Off(LED8);
    }
#endif /* STM32_BLUECOIN */
}



#endif /* ALLMEMS1_ACOUSTIC_SOURCE_LOCALIZATION */

/**
* @brief  Half Transfer user callback, called by BSP functions.
* @param  None
* @retval None
*/
void BSP_AUDIO_IN_HalfTransfer_CallBack(void)
{
  AudioProcess();
}

/**
* @brief  Transfer Complete user callback, called by BSP functions.
* @param  None
* @retval None
*/
void BSP_AUDIO_IN_TransferComplete_CallBack(void)
{
  AudioProcess();
}

/**
  * @brief  Send Environmetal Data (Temperature/Pressure/Humidity) to BLE
  * @param  None
  * @retval None
  */
static void SendEnvironmentalData(void)
{
  uint8_t Status;

#ifdef ALLMEMS1_DEBUG_NOTIFY_TRAMISSION
  if(W2ST_CHECK_CONNECTION(W2ST_CONNECT_STD_TERM)) {
     BytesToWrite = sprintf((char *)BufferToWrite,"Sending: ");
     Term_Update(BufferToWrite,BytesToWrite);
  } else {
    ALLMEMS1_PRINTF("Sending: ");
  }
#endif /* ALLMEMS1_DEBUG_NOTIFY_TRAMISSION */

  /* Notifications of Compass Calibration status*/
  if(FirstConnectionConfig) {
    Config_Notify(FEATURE_MASK_SENSORFUSION_SHORT,W2ST_COMMAND_CAL_STATUS,isCal ? 100: 0);
    Config_Notify(FEATURE_MASK_ECOMPASS,W2ST_COMMAND_CAL_STATUS,isCal ? 100: 0);
#ifdef ALLMEMS1_DEBUG_NOTIFY_TRAMISSION
     if(W2ST_CHECK_CONNECTION(W2ST_CONNECT_STD_TERM)) {
       BytesToWrite = sprintf((char *)BufferToWrite,"Cal=%d ",isCal);
       Term_Update(BufferToWrite,BytesToWrite);
     } else {
      ALLMEMS1_PRINTF("Cal=%d ",isCal);
     }
#endif /* ALLMEMS1_DEBUG_NOTIFY_TRAMISSION */
    FirstConnectionConfig=0;
    
