urzino/FanMonitoringBlueCoin/STM32CubeFunctionPack_ALLMEMS1_V3.2.0/Projects/Multi/Applications/ALLMEMS1/Src/main.c
#ifdef ALLMEMS1_ENABLE_SD_MEMS_RECORDING
    if( (!IsSdMemsRecording) && (!IsSdAudioRecording))
    {
#endif /* ALLMEMS1_ENABLE_SD_MEMS_RECORDING */
      /* Switch on/off the LED according to calibration */
      if(isCal){
          LedOnTargetPlatform();
      } else {
        LedOffTargetPlatform();
      }
#ifdef ALLMEMS1_ENABLE_SD_MEMS_RECORDING
    }
#endif /* ALLMEMS1_ENABLE_SD_MEMS_RECORDING */
  }

  /* Pressure,Humidity, and Temperatures*/
  if(W2ST_CHECK_CONNECTION(W2ST_CONNECT_ENV)) {
    float SensorValue;
    int32_t PressToSend=0;
    uint16_t HumToSend=0;
    int16_t Temp2ToSend=0,Temp1ToSend=0;
    int32_t decPart, intPart;

    if(TargetBoardFeatures.HandlePressSensor) {
      if(BSP_PRESSURE_IsInitialized(TargetBoardFeatures.HandlePressSensor,&Status)==COMPONENT_OK) {
        BSP_PRESSURE_Get_Press(TargetBoardFeatures.HandlePressSensor,(float *)&SensorValue);
        MCR_BLUEMS_F2I_2D(SensorValue, intPart, decPart);
        PressToSend=intPart*100+decPart;
#ifdef ALLMEMS1_DEBUG_NOTIFY_TRAMISSION
        if(W2ST_CHECK_CONNECTION(W2ST_CONNECT_STD_TERM)) {
          BytesToWrite = sprintf((char *)BufferToWrite,"Press=%ld ",PressToSend);
          Term_Update(BufferToWrite,BytesToWrite);
        } else {
          ALLMEMS1_PRINTF("Press=%ld ",PressToSend);
        }
#endif /* ALLMEMS1_DEBUG_NOTIFY_TRAMISSION */
      }
    }

#ifndef STM32_BLUECOIN
    if(TargetBoardFeatures.HandleHumSensor) {
      if(BSP_HUMIDITY_IsInitialized(TargetBoardFeatures.HandleHumSensor,&Status)==COMPONENT_OK){
        BSP_HUMIDITY_Get_Hum(TargetBoardFeatures.HandleHumSensor,(float *)&SensorValue);
        MCR_BLUEMS_F2I_1D(SensorValue, intPart, decPart);
        HumToSend = intPart*10+decPart;
#ifdef ALLMEMS1_DEBUG_NOTIFY_TRAMISSION
        if(W2ST_CHECK_CONNECTION(W2ST_CONNECT_STD_TERM)) {
          BytesToWrite = sprintf((char *)BufferToWrite,"Hum=%d ",HumToSend);
          Term_Update(BufferToWrite,BytesToWrite);
        } else {
          ALLMEMS1_PRINTF("Hum=%d ",HumToSend);
        }
#endif /* ALLMEMS1_DEBUG_NOTIFY_TRAMISSION */
      }
    }
#endif /* STM32_BLUECOIN */

    if(TargetBoardFeatures.NumTempSensors==2) {
      if(BSP_TEMPERATURE_IsInitialized(TargetBoardFeatures.HandleTempSensors[0],&Status)==COMPONENT_OK){
        BSP_TEMPERATURE_Get_Temp(TargetBoardFeatures.HandleTempSensors[0],(float *)&SensorValue);
        MCR_BLUEMS_F2I_1D(SensorValue, intPart, decPart);
        Temp1ToSend = intPart*10+decPart; 
#ifdef ALLMEMS1_DEBUG_NOTIFY_TRAMISSION
        if(W2ST_CHECK_CONNECTION(W2ST_CONNECT_STD_TERM)) {
          BytesToWrite = sprintf((char *)BufferToWrite,"Temp=%d ",Temp1ToSend);
          Term_Update(BufferToWrite,BytesToWrite);
        } else {
          ALLMEMS1_PRINTF("Temp=%d ",Temp1ToSend);
        }
#endif /* ALLMEMS1_DEBUG_NOTIFY_TRAMISSION */
      }

      if(BSP_TEMPERATURE_IsInitialized(TargetBoardFeatures.HandleTempSensors[1],&Status)==COMPONENT_OK){
        BSP_TEMPERATURE_Get_Temp(TargetBoardFeatures.HandleTempSensors[1],(float *)&SensorValue);
        MCR_BLUEMS_F2I_1D(SensorValue, intPart, decPart);
        Temp2ToSend = intPart*10+decPart;
#ifdef ALLMEMS1_DEBUG_NOTIFY_TRAMISSION
        if(W2ST_CHECK_CONNECTION(W2ST_CONNECT_STD_TERM)) {
          BytesToWrite = sprintf((char *)BufferToWrite,"Temp2=%d ",Temp2ToSend);
          Term_Update(BufferToWrite,BytesToWrite);
        } else {
          ALLMEMS1_PRINTF("Temp2=%d ",Temp2ToSend);
        }
#endif /* ALLMEMS1_DEBUG_NOTIFY_TRAMISSION */
      }
    } else if(TargetBoardFeatures.NumTempSensors==1) {
      if(BSP_TEMPERATURE_IsInitialized(TargetBoardFeatures.HandleTempSensors[0],&Status)==COMPONENT_OK){
        BSP_TEMPERATURE_Get_Temp(TargetBoardFeatures.HandleTempSensors[0],(float *)&SensorValue);
        MCR_BLUEMS_F2I_1D(SensorValue, intPart, decPart);
        Temp1ToSend = intPart*10+decPart;
#ifdef ALLMEMS1_DEBUG_NOTIFY_TRAMISSION
        if(W2ST_CHECK_CONNECTION(W2ST_CONNECT_STD_TERM)) {
          BytesToWrite = sprintf((char *)BufferToWrite,"Temp1=%d ",Temp1ToSend);
          Term_Update(BufferToWrite,BytesToWrite);
        } else {
          ALLMEMS1_PRINTF("Temp1=%d ",Temp1ToSend);
        }
#endif /* ALLMEMS1_DEBUG_NOTIFY_TRAMISSION */
      }
    }
    Environmental_Update(PressToSend,HumToSend,Temp2ToSend,Temp1ToSend);
  }

#ifdef ALLMEMS1_DEBUG_NOTIFY_TRAMISSION
  if(W2ST_CHECK_CONNECTION(W2ST_CONNECT_STD_TERM)) {
     BytesToWrite = sprintf((char *)BufferToWrite,"\r\n");
     Term_Update(BufferToWrite,BytesToWrite);
  } else {
    ALLMEMS1_PRINTF("\r\n");
  }
#endif /* ALLMEMS1_DEBUG_NOTIFY_TRAMISSION */
}

//#ifdef STM32_SENSORTILE
#if (defined(STM32_SENSORTILE) || defined(STM32_BLUECOIN))
/**
  * @brief  Send Battery Info Data (Voltage/Current/Soc) to BLE
  * @param  None
  * @retval None
  */
static void SendBatteryInfoData(void)
{
  uint32_t soc;
  int32_t current= 0;
  
#ifdef STM32_SENSORTILE
  uint32_t voltage;
  uint8_t v_mode;
  
  /* Update Gas Gouge Status */
  BSP_GG_Task(TargetBoardFeatures.HandleGGComponent,&v_mode);

  /* Read the Gas Gouge Status */
  BSP_GG_GetVoltage(TargetBoardFeatures.HandleGGComponent, &voltage);
  BSP_GG_GetCurrent(TargetBoardFeatures.HandleGGComponent, &current);
  BSP_GG_GetSOC(TargetBoardFeatures.HandleGGComponent, &soc);
#endif /* STM32_SENSORTILE */
  
#ifdef STM32_BLUECOIN
  uint16_t voltage;
  uint32_t VoltageFilteredValue;
  ChrgStatus_t BattStatus;
  
  
  if(flagBatt)
  {
    /* Read the voltage value */
    BSP_GetVoltage(&voltage);
    
    if(InitVoltageFilter)
    {
      for(int i=0;i<WINDOW_FILTER_VOLTAGE_VALUE_DIM;i++)
        WindowFilterVoltageValue[i]=(uint32_t)voltage;
      
      VoltageFilteredValue= (uint32_t)voltage;
      InitVoltageFilter= 0;
    }
    else
    {
      for(int i=0;i<WINDOW_FILTER_VOLTAGE_VALUE_DIM-1;i++)
        WindowFilterVoltageValue[i]=WindowFilterVoltageValue[i+1];
      
      WindowFilterVoltageValue[WINDOW_FILTER_VOLTAGE_VALUE_DIM-1]=(uint32_t)voltage;
    
      VoltageFilteredValue= 0;
      for(int i=0;i<WINDOW_FILTER_VOLTAGE_VALUE_DIM;i++)
        VoltageFilteredValue+= WindowFilterVoltageValue[i];
      VoltageFilteredValue= VoltageFilteredValue / WINDOW_FILTER_VOLTAGE_VALUE_DIM;
    }
    
