urzino/FanMonitoringBlueCoin/STM32CubeFunctionPack_ALLMEMS1_V3.2.0/Projects/Multi/Applications/ALLMEMS1/Src/main.c
    /* Read the battery charge status */
    BattStatus= BSP_GetChrgStatus();
    
    if(VoltageFilteredValue >= MAX_BATTERY_RANGE)
    {
      VoltageFilteredValue= MAX_BATTERY_RANGE;
    }
    
    if(VoltageFilteredValue <= MIN_BATTERY_RANGE)
    {
      VoltageFilteredValue= MIN_BATTERY_RANGE;
    }
    
    //soc= (((((uint32_t)voltage) - MIN_BATTERY_RANGE) * 1000)/(MAX_BATTERY_RANGE - MIN_BATTERY_RANGE));
    soc= (((VoltageFilteredValue - MIN_BATTERY_RANGE) * 100)/(MAX_BATTERY_RANGE - MIN_BATTERY_RANGE));
  }
  else
  {
    VoltageFilteredValue= 0;
    soc= 0;
    BattStatus= CHRG_STATUS_DISCHARGING;
  }

#endif /* STM32_BLUECOIN */
  
#ifdef ALLMEMS1_DEBUG_NOTIFY_TRAMISSION
  if(W2ST_CHECK_CONNECTION(W2ST_CONNECT_STD_TERM)) {
     BytesToWrite = sprintf((char *)BufferToWrite,"Battery Report: \r\n");
     Term_Update(BufferToWrite,BytesToWrite);
  } else {
    ALLMEMS1_PRINTF("Battery Report: \r\n");
  }
#endif /* ALLMEMS1_DEBUG_NOTIFY_TRAMISSION */

  /* Battery Informations */
  if(W2ST_CHECK_CONNECTION(W2ST_CONNECT_GG_EVENT)) {
#ifdef STM32_SENSORTILE
    GG_Update(soc, voltage, current);
#endif /* STM32_SENSORTILE */
    
#ifdef STM32_BLUECOIN    
    BatteryInfoUpdate(VoltageFilteredValue, BattStatus, soc);
#endif /* STM32_BLUECOIN */
    
#ifdef ALLMEMS1_DEBUG_NOTIFY_TRAMISSION
     if(W2ST_CHECK_CONNECTION(W2ST_CONNECT_STD_TERM)) {
       BytesToWrite = sprintf((char *)BufferToWrite,"Charge= %ld%% Voltage=%ld mV Current= %ld mA", soc, voltage, current);
       Term_Update(BufferToWrite,BytesToWrite);
     } else {
       ALLMEMS1_PRINTF("Charge= %ld%% Voltage=%ld mV Current= %ld mA", soc, voltage, current);
     }
#endif /* ALLMEMS1_DEBUG_NOTIFY_TRAMISSION */
  }

#ifdef ALLMEMS1_DEBUG_NOTIFY_TRAMISSION
  if(W2ST_CHECK_CONNECTION(W2ST_CONNECT_STD_TERM)) {
     BytesToWrite = sprintf((char *)BufferToWrite,"\r\n");
     Term_Update(BufferToWrite,BytesToWrite);
  } else {
    ALLMEMS1_PRINTF("\r\n");
  }
#endif /* ALLMEMS1_DEBUG_NOTIFY_TRAMISSION */
}
#endif /* STM32_SENSORTILE */

/**
  * @brief  CRC init function.
  * @param  None
  * @retval None
  */
static void MX_CRC_Init(void)
{
  hcrc.Instance = CRC;

  if (HAL_CRC_Init(&hcrc) != HAL_OK)
  {
    Error_Handler();
  }
}
/**
* @brief  Function for initializing timers for sending the information to BLE:
 *  - 1 for sending MotionFX/AR/CP and Acc/Gyro/Mag
 *  - 1 for sending the Environmental info
 * @param  None
 * @retval None
 */
static void InitTimers(void)
{
  
  uint32_t uwPrescalerValue;
  
  /* Timer Output Compare Configuration Structure declaration */
  TIM_OC_InitTypeDef sConfig;
  
  /* Compute the prescaler value to have TIM4 counter clock equal to 2 KHz */
#if defined(STM32F401xE) || defined (STM32L476xx)
  uwPrescalerValue = (uint32_t) ((SystemCoreClock / 2000) - 1);
#elif STM32F446xx
  uwPrescalerValue = (uint32_t) (((SystemCoreClock / 2) / 2000) - 1);
#endif /* defined(STM32F401xE) || defined (STM32L476xx) */
  
  /* Set TIM4 instance ( Environmental ) */
  TimEnvHandle.Instance = TIM4;
  /* Initialize TIM4 peripheral */
  TimEnvHandle.Init.Period = ENV_UPDATE_MUL_100MS*200 - 1;
  TimEnvHandle.Init.Prescaler = uwPrescalerValue;
  TimEnvHandle.Init.ClockDivision = 0;
  TimEnvHandle.Init.CounterMode = TIM_COUNTERMODE_UP;
  if(HAL_TIM_Base_Init(&TimEnvHandle) != HAL_OK) {
    /* Initialization Error */
  }

  /* Compute the prescaler value to have TIM1 counter clock equal to 10 KHz */
  uwPrescalerValue = (uint32_t) ((SystemCoreClock / 10000) - 1); 
  
  /* Set TIM1 instance ( Motion ) */
  TimCCHandle.Instance = TIM1;  
  TimCCHandle.Init.Period        = 65535;
  TimCCHandle.Init.Prescaler     = uwPrescalerValue;
  TimCCHandle.Init.ClockDivision = 0;
  TimCCHandle.Init.CounterMode   = TIM_COUNTERMODE_UP;
  if(HAL_TIM_OC_Init(&TimCCHandle) != HAL_OK)
  {
    /* Initialization Error */
    Error_Handler();
  }
  
 /* Configure the Output Compare channels */
 /* Common configuration for all channels */
  sConfig.OCMode     = TIM_OCMODE_TOGGLE;
  sConfig.OCPolarity = TIM_OCPOLARITY_LOW;

  /* Code for MotionFX integration - Start Section */
  /* Output Compare Toggle Mode configuration: Channel1 */
  sConfig.Pulse = DEFAULT_uhCCR1_Val;
  if(HAL_TIM_OC_ConfigChannel(&TimCCHandle, &sConfig, TIM_CHANNEL_1) != HAL_OK)
  {
    /* Configuration Error */
    Error_Handler();
  }
  /* Code for MotionFX integration - End Section */
  
  #if (defined(ALLMEMS1_MOTIONCP) || defined(ALLMEMS1_MOTIONGR))
  /* Output Compare Toggle Mode configuration: Channel2 */
  sConfig.Pulse = DEFAULT_uhCCR2_Val;
  if(HAL_TIM_OC_ConfigChannel(&TimCCHandle, &sConfig, TIM_CHANNEL_2) != HAL_OK)
  {
    /* Configuration Error */
    Error_Handler();
  }
  #endif /* defined(ALLMEMS1_MOTIONCP) || defined(ALLMEMS1_MOTIONGR)*/
  
  /* Code for MotionAR integration - Start Section */
  /* Output Compare Toggle Mode configuration: Channel3 */
  sConfig.Pulse = DEFAULT_uhCCR3_Val;
  if(HAL_TIM_OC_ConfigChannel(&TimCCHandle, &sConfig, TIM_CHANNEL_3) != HAL_OK)
  {
    /* Configuration Error */
    Error_Handler();
  }
  /* Code for MotionAR integration - End Section */
  
  /* Output Compare Toggle Mode configuration: Channel4 */
  sConfig.Pulse = DEFAULT_uhCCR4_Val;
  if(HAL_TIM_OC_ConfigChannel(&TimCCHandle, &sConfig, TIM_CHANNEL_4) != HAL_OK)
  {
    /* Configuration Error */
    Error_Handler();
  }
  
    /* Compute the prescaler value to have TIM5 counter clock equal to 10 KHz */
#if defined(STM32F401xE) || defined (STM32L476xx)
  uwPrescalerValue = (uint32_t) ((SystemCoreClock / 10000) - 1);
#elif STM32F446xx
  uwPrescalerValue = (uint32_t) (((SystemCoreClock / 2) / 10000) - 1);
#endif /* defined(STM32F401xE) || defined (STM32L476xx) */
  
  /* Set TIM5 instance ( Mic ) */
  TimAudioDataHandle.Instance = TIM5;
  TimAudioDataHandle.Init.Period = MICS_DB_UPDATE_MUL_10MS*100 - 1;
  TimAudioDataHandle.Init.Prescaler = uwPrescalerValue;
  TimAudioDataHandle.Init.ClockDivision = 0;
  TimAudioDataHandle.Init.CounterMode = TIM_COUNTERMODE_UP;
  if(HAL_TIM_Base_Init(&TimAudioDataHandle) != HAL_OK) {
    /* Initialization Error */
    Error_Handler();
  }
  
