urzino/FanMonitoringBlueCoin/STM32CubeFunctionPack_ALLMEMS1_V3.2.0/Projects/Multi/Applications/ALLMEMS1/Src/main.c
  /* Infinite loop */
  while (1){
  }
}
#endif

/**
 * @brief  Test if calibration data are available
 * @param  None
 * @retval None
 */
static void MagCalibTest(void)
{
  MFX_MagCal_output_t mag_cal_test;
  
  /* Recall the calibration Credential saved */
  MotionFX_manager_MagCal_start(SAMPLE_PERIOD);
  MotionFX_MagCal_getParams(&mag_cal_test);
    
  if(CalibrationData[0]== BLUEMSYS_CHECK_CALIBRATION) {
#ifdef STM32_NUCLEO
    if(CalibrationData[1] == TargetBoardFeatures.mems_expansion_board) {
#endif /* STM32_NUCLEO */
      
      if( (mag_cal_test.cal_quality == MFX_MAGCALOK) ||
          (mag_cal_test.cal_quality == MFX_MAGCALGOOD) )
      {
        MAG_Offset.AXIS_X = (int32_t) (mag_cal_test.hi_bias[0] * FROM_UT50_TO_MGAUSS);
        MAG_Offset.AXIS_Y = (int32_t) (mag_cal_test.hi_bias[1] * FROM_UT50_TO_MGAUSS);
        MAG_Offset.AXIS_Z = (int32_t) (mag_cal_test.hi_bias[2] * FROM_UT50_TO_MGAUSS);

        isCal =1;
        
        ALLMEMS1_PRINTF("Magneto Calibration Read\r\n");
      }
      else
      {
        isCal =0;
        ALLMEMS1_PRINTF("Magneto Calibration quality is not good\r\n");
      }
#ifdef STM32_NUCLEO
    } else {
      ALLMEMS1_PRINTF("Magneto Calibration Not correct for Current %s board\r\n",TargetBoardFeatures.mems_expansion_board ? "IKS01A2" : "IKS01A1");
      ResetCalibrationInMemory();
      MotionFX_manager_MagCal_start(SAMPLE_PERIOD);
      MotionFX_MagCal_getParams(&mag_cal_test);      
      isCal=0;
    }
#endif /* STM32_NUCLEO */
  } else {
    ALLMEMS1_PRINTF("Magneto Calibration Not present\r\n");
    isCal=0;
  }
  
  if(!isCal)
  {
    MAG_Offset.AXIS_X = 0;
    MAG_Offset.AXIS_Y = 0;
    MAG_Offset.AXIS_Z = 0;
  }
}

/**
 * @brief  Check if there are a valid Calibration Values in Memory and read them
 * @param uint32_t *MagnetoCalibration the Magneto Calibration
 * @retval unsigned char Success/Not Success
 */
unsigned char ReCallCalibrationFromMemory(uint16_t dataSize, uint32_t *data)
{
  /* ReLoad the Calibration Values from RAM */
  unsigned char Success=0;

  int i;
  
  /* Recall the calibration Credential saved */
  MDM_ReCallGMD(GMD_CALIBRATION,(void *)&CalibrationData);
  
  for(i=0; i<dataSize; i++)
  {
    data[i]= CalibrationData[i+2];
  }

  return Success;
}

/**
 * @brief  Save the Magnetometer Calibration Values to Memory
 * @param uint32_t *MagnetoCalibration the Magneto Calibration
 * @retval unsigned char Success/Not Success
 */
unsigned char SaveCalibrationToMemory(uint16_t dataSize, uint32_t *data)
{
  unsigned char Success=1;
  
  int i;

  /* Reset Before The data in Memory */
  //Success = ResetCalibrationInMemory();

  if(Success) {
    /* Store in RAM */
    CalibrationData[0] = BLUEMSYS_CHECK_CALIBRATION;
    CalibrationData[1] = TargetBoardFeatures.mems_expansion_board;

    
    for(i=0; i<dataSize; i++)
    {
      CalibrationData[i+2]= data[i];
    }
 
    if(W2ST_CHECK_CONNECTION(W2ST_CONNECT_STD_TERM)) {
     BytesToWrite = sprintf((char *)BufferToWrite, "Magneto Calibration will be saved in FLASH\r\n");
     Term_Update(BufferToWrite,BytesToWrite);
    } else {
      ALLMEMS1_PRINTF("Magneto Calibration will be saved in FLASH\r\n");
    }

    MDM_SaveGMD(GMD_CALIBRATION,(void *)&CalibrationData);
    
    NecessityToSaveMetaDataManager=1;
  }

  return Success;
}

/**
 * @brief  Reset the Magnetometer Calibration Values in Memory
 * @param uint32_t *MagnetoCalibration the Magneto Calibration
 * @retval unsigned char Success/Not Success
 */
static unsigned char ResetCalibrationInMemory(void)
{
  /* Reset Calibration Values in RAM */
  unsigned char Success=1;
  int32_t Counter;

  for(Counter=0;Counter<29;Counter++)
    CalibrationData[Counter]=0x0;
    //CalibrationData[Counter]=0xFFFFFFFF;

  if(W2ST_CHECK_CONNECTION(W2ST_CONNECT_STD_TERM)) {
     BytesToWrite = sprintf((char *)BufferToWrite, "Magneto Calibration will be eresed in FLASH\r\n");
     Term_Update(BufferToWrite,BytesToWrite);
  } else {
    ALLMEMS1_PRINTF("Magneto Calibration will be eresed in FLASH\r\n");
  }
  
  MDM_SaveGMD(GMD_CALIBRATION,(void *)&CalibrationData);

  NecessityToSaveMetaDataManager=1;
  return Success;
}

/******************* (C) COPYRIGHT 2017 STMicroelectronics *****END OF FILE****/
